IDENTIFICATION DIVISION.
PROGRAM-ID. AULA4.
DATA DIVISION.
WORKING-STORAGE SECTION.

       77 WS-CONTEUDO PIC X(100) VALUE SPACES.
       77 WS-TEXTO    PIC X(30) VALUE SPACES.

PROCEDURE DIVISION.

        MOVE 'OLA ESTAVAS AQUI ?' TO WS-TEXTO.

       STRING
       'PEDRO'
       ' '
       WS-TEXTO(1:8)
       'S '
       'AQUI'
       DELIMITED BY SIZE INTO WS-CONTEUDO
       END-STRING.   

       DISPLAY WS-CONTEUDO.

STOP RUN.
END PROGRAM AULA4.