IDENTIFICATION DIVISION.
PROGRAM-ID. AULA3.
DATA division.
WORKING-STORAGE SECTION.

01 WS-NOME.

       03 WS-NOME-PRIMEIRO PIC X(10) VALUE 'Pedro'.
       03 FILLLLER   PIC X(10) VALUE 'Pedrao'.
       03 WS-NUM     PIC 9(02) VALUE 10.

PROCEDURE DIVISION.
       
       DISPLAY 'VALORES DA VARIAVEL NOME: '.
       DISPLAY WS-NOME.

       DISPLAY 'Saida 2 '
       INITIALIZE WS-NOME REPLACING ALPHANUMERIC BY SPACES
                                    NUMERIC BY ZEROS.
       DISPLAY WS-NOME.
       
STOP RUN.
END PROGRAM AULA3.