IDENTIFICATION DIVISION.
PROGRAM-ID. AULA5.
DATA DIVISION.
WORKING-STORAGE SECTION.

       77 WS-NUM PIC 9(02) VALUE ZEROS.
       77 WS-NUM2 PIC 9(02) VALUE ZEROS.
       77 WS-RESULTADO PIC 9(02) VALUE ZEROS.

PROCEDURE DIVISION.

P001-INICIO.

       PERFORM P100-CALC.
       PERFORM P999-FIM.
P100-CALC.

       DISPLAY '1 Numero '.
       ACCEPT WS-NUM.
     

       DISPLAY '2 NUMERO '.
       ACCEPT WS-NUM2.
    

       COMPUTE WS-RESULTADO = WS-NUM * WS-NUM2
           ON SIZE ERROR PERFORM P800-ERROR.

       DISPLAY 'O resultado é ' WS-RESULTADO.
               
P800-ERROR.

       DISPLAY ' '.
       DISPLAY 'ERRO DE CALCULO'.
       DISPLAY ' '.
       PERFORM P999-FIM.
P999-FIM.
       STOP RUN.
       

END PROGRAM AULA5.