       IDENTIFICATION DIVISION.
       PROGRAM-ID. AULA12.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
           
       01 WS-PARAMETROS.
           02 WS-RC PIC 9(02).    

       PROCEDURE DIVISION.
           DISPLAY "OLA".
           MOVE 1 TO WS-RC.

           GOBACK.
       END PROGRAM AULA12.
