IDENTIFICATION DIVISION.
PROGRAM-ID. AULA7.
      DATA DIVISION.


      WORKING-STORAGE SECTION.
       
       01 WS-LAYOUT-1.
           03 WS-NOME PIC X(30).
           03 WS-ENDERECO PIC X(30).
           03 WS-TELEFONE PIC X(30).
           03 WS-EMAIL PIC X(30).
           03 WS-CIDADE PIC X(30).
           03 WS-ESTADO PIC X(30).
       
       01 WS-LAYOUT-2.
           03 WS-NOME PIC X(30).
           03 WS-ENDERECO PIC X(30).
           03 WS-TELEFONE PIC X(30).
           03 WS-EMAIL PIC X(30).
           03 WS-UF PIC X(30).
           03 WS-CIDADE PIC X(30).
       
      PROCEDURE DIVISION.

       MOVE 'Pedro' TO WS-NOME OF WS-LAYOUT-1.
       MOVE 'Lisboa' TO WS-ENDERECO OF WS-LAYOUT-1.
       MOVE '935072271' TO WS-TELEFONE OF WS-LAYOUT-1.
       MOVE 'EX@HOTMAIL.COM' TO WS-EMAIL OF WS-LAYOUT-1.
       MOVE 'LISBOA' TO WS-CIDADE OF WS-LAYOUT-1.
       MOVE 'PORTUGAL' TO WS-ESTADO OF WS-LAYOUT-1.
       
       MOVE CORR WS-LAYOUT-1 TO WS-LAYOUT-2.

       DISPLAY WS-LAYOUT-1.
       DISPLAY WS-LAYOUT-2.

STOP RUN.
END PROGRAM AULA7.
