IDENTIFICATION DIVISION.
PROGRAM-ID. TESTE.
DATA division.
WORKING-STORAGE SECTION.

       77 WS-NUM1 PIC 9(02).
       77 WS-NUM2 PIC 9(02).
       77 WS-NUM-RES PIC 9(02).

  
       01 WS-CONTACTO-USER.
           02 WS-NOME  PIC X(30).
           02 WS-EMAIL PIC X(30).
           02 WS-RUA   PIC X(30).

PROCEDURE DIVISION.
       
       PERFORM P100-INICIO.
       PERFORM P200-CALC.
       PERFORM P999-FIM.

P100-INICIO.

       DISPLAY 'NUM 1'.
       ACCEPT WS-NUM1.
       DISPLAY 'NUM 2'
       ACCEPT WS-NUM2.

P200-CALC.
       
       COMPUTE WS-NUM-RES = WS-NUM1 + WS-NUM2
               ON SIZE ERROR PERFORM P300-ERRO.
       DISPLAY 'A soma deu ' WS-NUM-RES.

P300-ERRO.
       DISPLAY 'ERRO DE CALCULO'.


P999-FIM.
       STOP RUN.

END PROGRAM TESTE.