       IDENTIFICATION DIVISION.
       PROGRAM-ID. AULA.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       DATA DIVISION.
       FILE SECTION.

       WORKING-STORAGE SECTION.
           
       01 WS-FINANCIAMENTO.
           03 WS-CLIENTE PIC X(20).
           03 WS-OBJETO PIC X(20).
           03 WS-VALOR PIC 9(06)V99.
           03 WS-NUM-PARCELAS PIC 99.
           03 WS-PARCELAS PIC 9(5)V99 OCCURS 1 TO 420 
                          TIMES DEPENDING ON WS-NUM-PARCELAS.

       01 WS-VARIAVEIS.
           03 WS-VLR-PARCELAS PIC 9(5)V99.
           03 WS-IND PIC 99.

       PROCEDURE DIVISION.

       MAIN-PROCEDURE.
       
       INITIALIZE WS-VARIAVEIS.

       DISPLAY 'INFORME O NOME DO CLIENTE: '.
       ACCEPT WS-CLIENTE.
       DISPLAY 'OBJETO FINANCIADO ? '.
       ACCEPT WS-OBJETO.
       DISPLAY 'VALOR DO OBJETO ?'
       ACCEPT WS-VALOR.
       DISPLAY 'INDIQUE O NUMERO DE PARCELAS: '
       ACCEPT WS-NUM-PARCELAS.

       COMPUTE WS-VLR-PARCELAS = WS-VALOR / WS-NUM-PARCELAS.

       PERFORM UNTIL WS-IND EQUAL WS-NUM-PARCELAS
           ADD 1 TO WS-IND
           MOVE WS-VLR-PARCELAS TO WS-PARCELAS(WS-IND)
       END-PERFORM.

       PERFORM VARYING WS-IND FROM 1 BY 1 UNTIL WS-IND > WS-NUM-PARCELAS
           DISPLAY 'PARCELA N: ' WS-IND ' VALOR: ' WS-PARCELAS(WS-IND)
       END-PERFORM.
       
           
       STOP RUN.
       END PROGRAM AULA.