       IDENTIFICATION DIVISION. 
       PROGRAM-ID. TESTE22.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.

       FILE-CONTROL.

       SELECT VOOSINPUT ASSIGN TO 
           "/Users/antonyferreira/Documents/Cobol/project/voos.dat"
           ORGANIZATION IS INDEXED 
           ACCESS MODE IS DYNAMIC 
           RECORD KEY IS VOOSINPUT-ID
           FILE STATUS IS WS-FICHEIRO-STATUS-VOO.
           
       DATA DIVISION.

       FILE SECTION.
           
           FD VOOSINPUT.
           01 VOOSINPUT-REG.
               05 VOOSINPUT-ID PIC 9(02).
               05 VOOSINPUT-NOME PIC X(10).           

       WORKING-STORAGE SECTION.
           
           01 WS-FICHEIRO-STATUS-VOO PIC XX.
               88 WS-FICHEIRO-VOO-OK VALUE 00.

           01 WS-REGISTO-VOOS-LOCAL PIC X(12).
               01 FILLER REDEFINES WS-REGISTO-VOOS-LOCAL.
               05 VOOS-ID PIC 9(02).
               05 VOOS-NOME PIC X(10).


           77 WS-EXIT-OK PIC X(02) VALUE 'N'.

           77 WS-ID-ALTERA PIC 9(02) VALUE ZEROES.

           77 WS-NOME-ALTERA PIC X(10) VALUE SPACES.



       PROCEDURE DIVISION.

       PERFORM P100-ADICIONAR-VOO THRU P200-VER-VOOS.

       P100-ADICIONAR-VOO.

           OPEN I-O VOOSINPUT.
           
           DISPLAY "ADICIONA O NUMERO DO VOO".
           ACCEPT VOOSINPUT-ID.
           DISPLAY "ADICIONA O NOME DO VOO".
           ACCEPT VOOSINPUT-NOME.
           WRITE VOOSINPUT-REG.
           CLOSE VOOSINPUT.

       P200-VER-VOOS.

           OPEN I-O VOOSINPUT.
           
           PERFORM UNTIL WS-EXIT-OK = "S" OR  WS-EXIT-OK = "s"
               READ VOOSINPUT
                   AT END 
                       DISPLAY "FICHEIRO CHEGOU AO FIM"
                       SET WS-EXIT-OK TO "S"
                   NOT AT END 
                       MOVE VOOSINPUT-ID TO VOOS-ID
                       MOVE VOOSINPUT-NOME TO VOOS-NOME
                       DISPLAY "VOO N - " VOOS-ID " NOME DE VOO "
                                               VOOSINPUT-NOME
               END-READ

           END-PERFORM.

           SET WS-EXIT-OK TO "N".

           CLOSE VOOSINPUT.

       P300-ALTERAR-VOOS.
           
           DISPLAY "Insere o nome a alterar".
           MOVE VOOSINPUT-NOME TO WS-NOME-ALTERA.

           OPEN I-O VOOSINPUT.

           PERFORM UNTIL WS-EXIT-OK = "S" OR WS-EXIT-OK = "s"
               READ VOOSINPUT
                   AT END 
                       DISPLAY "FICHEIRO CHEGOU AO FIM"
                       SET WS-EXIT-OK TO "S"
                   NOT AT END 
                       IF VOOSINPUT-ID = WS-ID-ALTERA
                           DISPLAY "ID ENCONTRADO - SIGA OS PASSOS "
                           DISPLAY "NOME ATUAL: " VOOSINPUT-NOME
                           DISPLAY "INSIRA UM NOVO NOME PARA O VOO"
                           ACCEPT WS-NOME-ALTERA
                           MOVE WS-NOME-ALTERA TO VOOS-NOME
                           REWRITE VOOSINPUT-REG
                           DISPLAY "REGISTO EFETUADO COM SUCESSO"
                           SET WS-EXIT-OK TO "S"   
                       END-IF
                END-READ
           END-PERFORM.
           CLOSE VOOSINPUT.

                       
           

       STOP RUN.
